public class Game {

    public static final int FIELD_WIDTH = 10;
    public static final int FIELD_HEIGHT = 10;

    public static void main(String[] args) {
        //todo:
        /*
        1. Запрашиваем количество игроков. По умолчанию - 2, максимум 4.
        2. Запрашиваем ввод имен игроков. Игроки для которых имя не введено будут AI
        3. Создаем AI игроков
        4. Создаем менеджер игры
        5. Запускаем игру
        6. Спрашиваем нужна ли переигровка или новая игра? (переигровка -> п.4, новая игра -> п.1, иначе завершаем работу
         */

    }
}
